import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

data = np.array([
    ["Налоговые доходы", 29287.9, 23.3],
    ["Подоходный налог", 5760.2, 4.6],
    ["Налог на прибыль", 2956.9, 2.3],
    ["Налоги на собственность", 1088.6, 0.9],
    ["Налог на добавленную стоимость", 10829.0, 8.6],
    ["Акцизы", 2643.3, 2.1],
    ["Налоговые доходы от внешнеэкономической деятельности", 3653.7, 2.9]
])

df = pd.DataFrame(data=data[:, 1], index=data[:, 0], dtype=np.float32)
print(df)
df.plot.pie(subplots=True, figsize=(11, 6), title='Основные параметры консолидированного бюджета Республики Беларусь млрд. рублей за 2021 год')
plt.show()
print(df)

